src/test/resources/apiXml/JLR/GetJobDifficulties.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:men="http://www.cliffordthames.com/ebusiness/menus/">
   <soapenv:Header/>
   <soapenv:Body>
      <men:getJobDifficulties xmlns="http://www.cliffordthames.com/ebusiness/menus/">
         <men:jobDifficultiesRequest>
            <men:dealerDetails countryCode="GB" dealerIdentificationCode="Automation" languageCode="EN" manufacturer="JLR" password="O3Cg0d3l751" user="Automation" vehicleFileID="0"/>
         </men:jobDifficultiesRequest>
      </men:getJobDifficulties>
   </soapenv:Body>
</soapenv:Envelope>